text/03-infix-evaluator.org
#+title: Chapter 3 : Infix Evaluator

* <<intro>>

In the previous chapter we wrote a translator,
in this chapter we shall write an evaluator.
Arithmetical expressions such as =2 + 3= have a value, here =5=;
and expressions such as =x + y= have a value which depends
on the values of the variables.
The same holds of logical formulas such as =p & q=,
which is true if p is true and q is true, otherwise it is false.
To avoid complications with propositional variables,
we shall only use two constants: =0= and =1=,
for =FALSE= and =TRUE=.
Then for example the formula =1 & 0= is false,
and we say that its value is =0=.
The evaluator uses infix notation,
but to keep the implementation as simple as possible,
outer parentheses may not be omitted.

* User manual

The program INFEVL evaluates logical formulas in infix notation.
When the program is ready to read a formula,
it provides the prompt:

#+begin_example
        Formula :
#+end_example

and then it expects a formula of propositional logic

#+begin_example
formula  ::=
        '0' | '1' |
        '-' formula |
        '(' formula ( 'v' | '&' | '>' | '=' ) formula ')'
#+end_example

The program ignores white space such as blanks, tabs or newlines.
When the reading of the formula is completed,
the program writes the value of the formula in the form

#+begin_example
        Value  : x
#+end_example

where x is either =0= or =1=.
Then the program writes a new prompt.
Evaluation of formulas is defined recursively,
for atomic and for compound formulas.
Atomic formulas =0= and =1= evaluate to themselves.
Compound formulas are evaluated in accordance with the
following truth tables,
where =p= and =q= are arbitrary formulas,
and the columns below give their values:

#+begin_example
Unary Operator
    p   |       -p
    ----+---------
    0   |       1
    1   |       0
#+end_example

#+begin_example
Binary Operators
    p q   |     p v q   p & q   p > q   p = q
    ------+----------------------------------
    0 0   |       0       0       1       1
    0 1   |       1       0       1       0
    1 0   |       1       0       0       0
    1 1   |       1       1       1       1
#+end_example

If during the reading of a formula an error is detected,
an error message is given.
If the offending character is ="X"=,
then the message will be one of

#+begin_example
Error : seen "X" when "&","v",">" or "=" expected
Error : seen "X" when "0","1","-" or "(" expected
Error : seen "X" when ")" expected
#+end_example

depending on where in the parse the error occurs.
The program terminates when it reaches
the end of the input file;
if this occurs in the middle of a formula then no error
message is given.
The following is an example run of the program.
The second last formula is here written over several lines,
and the last input line contains an intentional error.

#+begin_example
Formula : 1
Value   : 1
Formula : (1 & (1 > 0))
Value   : 0
Formula : (             0 =     (1 = 0  ) )
Value   : 1
Formula : (
            (1 = 1)
          &
            (1 > 0)
          )
Value   : 0
Formula : ( 1 ? 0 )
  Error : seen "?" when "v","&",">" or "=" expected
#+end_example

To exit the program one types =^C= (control-=C=).

