03-infix-evaluator.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Chapter 3 : Infix Evaluator</title>
<!-- 2013-05-31 Fri 19:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="michal"/>
<link rel="stylesheet" type="text/css" href="/etc/style.css">
</head>
<body>
<div id="content">
<h1 class="title">Chapter 3 : Infix Evaluator</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. </a></li>
<li><a href="#sec-2">2. User manual</a></li>
<li><a href="#sec-3">3. Designing the implementation</a></li>
<li><a href="#sec-4">4. The program</a></li>
<li><a href="#sec-5">5. Exercises and reading</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <a id="intro" name="intro"></a></h2>
<div class="outline-text-2" id="text-1">
<p>
In the previous chapter we wrote a translator,
in this chapter we shall write an evaluator.
Arithmetical expressions such as <code>2 + 3</code> have a value, here <code>5</code>;
and expressions such as <code>x + y</code> have a value which depends
on the values of the variables.
The same holds of logical formulas such as <code>p &amp; q</code>,
which is true if p is true and q is true, otherwise it is false.
To avoid complications with propositional variables,
we shall only use two constants: <code>0</code> and <code>1</code>,
for <code>FALSE</code> and <code>TRUE</code>.
Then for example the formula <code>1 &amp; 0</code> is false,
and we say that its value is <code>0</code>.
The evaluator uses infix notation,
but to keep the implementation as simple as possible,
outer parentheses may not be omitted.
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> User manual</h2>
<div class="outline-text-2" id="text-2">
<p>
The program INFEVL evaluates logical formulas in infix notation.
When the program is ready to read a formula,
it provides the prompt:
</p>

<pre class="example">
Formula :
</pre>

<p>
and then it expects a formula of propositional logic
</p>

<pre class="example">
formula  ::=
        '0' | '1' |
        '-' formula |
        '(' formula ( 'v' | '&amp;' | '&gt;' | '=' ) formula ')'
</pre>

<p>
The program ignores white space such as blanks, tabs or newlines.
When the reading of the formula is completed,
the program writes the value of the formula in the form
</p>

<pre class="example">
Value  : x
</pre>

<p>
where x is either <code>0</code> or <code>1</code>.
Then the program writes a new prompt.
Evaluation of formulas is defined recursively,
for atomic and for compound formulas.
Atomic formulas <code>0</code> and <code>1</code> evaluate to themselves.
Compound formulas are evaluated in accordance with the
following truth tables,
where <code>p</code> and <code>q</code> are arbitrary formulas,
and the columns below give their values:
</p>

<pre class="example">
Unary Operator
    p   |       -p
    ----+---------
    0   |       1
    1   |       0
</pre>

<pre class="example">
Binary Operators
    p q   |     p v q   p &amp; q   p &gt; q   p = q
    ------+----------------------------------
    0 0   |       0       0       1       1
    0 1   |       1       0       1       0
    1 0   |       1       0       0       0
    1 1   |       1       1       1       1
</pre>

<p>
If during the reading of a formula an error is detected,
an error message is given.
If the offending character is ="X"=,
then the message will be one of
</p>

<pre class="example">
Error : seen "X" when "&amp;","v","&gt;" or "=" expected
Error : seen "X" when "0","1","-" or "(" expected
Error : seen "X" when ")" expected
</pre>

<p>
depending on where in the parse the error occurs.
The program terminates when it reaches
the end of the input file;
if this occurs in the middle of a formula then no error
message is given.
The following is an example run of the program.
The second last formula is here written over several lines,
and the last input line contains an intentional error.
</p>

<pre class="example">
Formula : 1
Value   : 1
Formula : (1 &amp; (1 &gt; 0))
Value   : 0
Formula : (             0 =     (1 = 0  ) )
Value   : 1
Formula : (
            (1 = 1)
          &amp;
            (1 &gt; 0)
          )
Value   : 0
Formula : ( 1 ? 0 )
  Error : seen "?" when "v","&amp;","&gt;" or "=" expected
</pre>

<p>
To exit the program one types <code>^C</code> (control-=C=).
</p>
</div>
</div>
