03-infix-evaluator.html
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Designing the implementation</h2>
<div class="outline-text-2" id="text-3">
<p>
If you have understood our previous program,
then this one should not be difficult.
But perhaps you should read about
parameters of procedures, both value parameters and variable parameters.
Also, you need to know about type declarations.
The main program is very simple &#x2014; essentially it is just a loop
for writing the prompt, reading and evaluating a formula,
and writing the value.
Nominally the loop goes on forever.
Before and after the loop we need two labels to jump
to: the first when an error has been detected,
the second when the end of the file has been reached.
The reading and the evaluating of a formula is done by
a procedure called <code>infix</code>.
It is best to design it first without the evaluation part in mind.
</p>

<p>
In infix notation there are essentially three places
where a user might have inserted blanks:
before a formula, before an infix operator,
and before a closing parenthesis.
At each of these places procedure <code>infix</code>
must be prepared to skip characters up to the next
printing character.
This is best done by a local procedure <code>getch</code>,
when it returns the last printing character is in a local variable.
The body of <code>infix</code> follows the BNF grammar for infix notation
almost to the letter.
But there are three places where errors can occur:
at the beginning of a formula, where an infix operator
should be, and where a closing parenthesis <code>)</code> should be.
The error reporting is best done by a local
procedure <code>error</code>,
which has to be told what the specific error message is.
The two local procedures <code>getch</code> and <code>error</code>
have bodies that are essentially familiar
from our previous program.
The procedure <code>error</code> has a (value) parameter
which is that part of the error message
which differs on its three possible calls.
Note that the type of the message parameter
has to be given globally in a type declaration.
</p>

<p>
As described up to this point,
procedure <code>infix</code> does not do any evaluating.
If you are writing the program yourself,
you are strongly urged to write the program
exactly up to here &#x2014;
all it can do is eat up characters and sometimes complain.
The evaluation part then comes as a refinement which
we describe next.
To begin with,
every subformula has a value,
and the whole formula has a value.
Procedure <code>infix</code> has to compute this value,
and when it has done so,
it has to put the value somewhere
for use later &#x2014; by itself if the call was recursive,
by the main program if the call was from the main program.
So we give procedure <code>infix</code> a so-called variable or
<code>VAR</code> parameter
which has to be of type Boolean.
When <code>infix</code> reads an atom
it sets this parameter to false or true respectively.
When <code>infix</code> reads a negation,
it calls itself,
but with a local variable of type boolean,
and when that returns it sets the parameter to the opposite
value of what that local value is.
When <code>infix</code> reads a parenthesis,
it calls itself with one local variable,
then it has to read the infix operator and remember it,
then it calls itself with another local variable.
Depending on what the remembered operator was,
it then sets the parameter to a value
computed from the two local variables.
</p>

<p>
Beginning programmers often have difficulty with
computing Boolean values,
probably because they do a lot of numeric programming
and encounter Boolean expressions only inside
<code>IF</code>'s and <code>WHILE</code>'s, and then in the form <code>i = 0</code> or the like.
In the infix evaluator,
suppose the parameter to be set is <code>x</code>,
and the two local variables are <code>y</code> and <code>z</code>.
Then for the remembered operator for material equivalence <code>=</code>,
a logically correct way of setting the parameter
to its value computed from the two local variables is this:
</p>

<pre class="example">
IF  y = true AND z = true  OR  y = false AND z = false
    THEN x := true
    ELSE x := false
</pre>

<p>
Apart from syntax errors which the Pascal compiler will pick up,
the statement reveals three independent and deep misunderstandings
of the data type Boolean.
If you cannot spot all four points,
you should consult a good text book.
</p>

<p>
For the remembered material equivalence operator <code>&gt;</code>
the situation is very similar.
You might initially write a complex <code>IF</code> statement
when actually a simple assignment statement will do.
</p>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> The program</h2>
<div class="outline-text-2" id="text-4">
<p>
The following is the standard Pascal source program
for the infix evaluator.
</p>

<pre class="example">
PROGRAM infix_evaluator(input,output);

LABEL 1, 99;

VAR
    value : boolean;

PROCEDURE infix(VAR x : boolean);

TYPE   message = PACKED ARRAY [1..30] OF char;

VAR ch,oper : char; y,z : boolean;

    PROCEDURE getch;
    BEGIN (* getch *)
    REPEAT
        IF eof THEN GOTO 99;
        read(ch)
        UNTIL ch &gt; ' '
    END; (* getch *)

    PROCEDURE error(mes : message);
    BEGIN (* error *)
    writeln('  ERROR : seen "',ch,'" when ',mes);
    readln;
    GOTO 1
    END; (* error *)

BEGIN (* infix *)
getch;
CASE ch OF
    '0' :
        x := false;
    '1' :
        x := true;
    '-' :
        BEGIN
        infix(z);
        x := NOT z
        END;
    '(' :
        BEGIN
        infix(y);
        getch;
        IF NOT (ch IN ['&amp;','v','&gt;','=']) THEN
            error('"&amp;","v","&gt;" or "=" expected   ');
        oper := ch;
        infix(z);
        getch;
        IF ch &lt;&gt; ')' THEN
            error('")" expected                  ');
        CASE oper OF
            '&amp;' : x := y AND z;
            'v' : x := y OR z;
            '&gt;' : X := y &lt;= z;
            '=' : x := y = z;
            END (* CASE *)
        END;
    OTHERWISE
        error('"0","1","-" or "(" expected   ');
    END (* CASE *)
END; (* infix *)

BEGIN (* main *)
1: REPEAT
    write('Formula : ');
    infix(value);
    writeln('Value   : ', ord(value):1)
    UNTIL false;
99:
END.
</pre>

<p>
Strictly speaking it is not necessary to have the two local variables
<code>y</code> and <code>z</code> in procedure <code>infix</code>,
just one will do, say <code>z</code>.
Then for the formulas beginning with a parenthesis
the first recursive call has to be made <code>infix(x)</code>,
and the four cases changed accordingly.
But the saving does not justify even these few lines of explanation.
\fi
</p>
</div>
</div>
