text/03-infix-evaluator.org
* Exercises and reading

/No GOTO/:
Rewrite the program without GOTO.

/Prefix notation/:
Write an evaluator for logical expressions in prefix
notation.
You should write the parser first,
and you might well do so by /cannibalising/
the program from the previous chapter.
Of course you will have to replace the atoms =a= .. =z=
by =0= and =1=.
Write a manual, too.
A more ambitious project is to write an evaluator
for Cambridge notation.

/End of file/:
Neither this program nor the one in the previous chapter
treats end of file inside a formula well:
there really should be an error message.
But how can you then deal with end of file
when the user has finished?
Devise some method and implement it.
Change the manual where appropriate.

/Translator/:
Write a translator from fully parenthesised
infix notation to prefix notation.
This is one of the translation problems mentioned at the end
of the previous chapter which involved shifting operators
forward.
>From fully parenthesised infix notation it is not all that hard.

/No outermost parentheses/:
It would be nice if the outermost parentheses of formulas
could be omitted. What problems do you foresee?
You should keep in mind that users might want to write
a formula over several lines,
and also that they write trailing blanks on the same line.
Discuss these problems, and propose a solution.

/Minimising Parentheses/:
When there are long conjunctions etc.
the infix notation used here forces users to write
a Lot of Irritating Silly Parentheses.
For example, assuming that
=p=, =q=, =r=, =s= are formulas,
instead of =p & q & r & s=
one has to write =((p & q) & (r & s))=
or something like that.
Can you fix the program
so that it allows operator precedences
described in the exercises of the previous chapter?
Does your method work for =p > q > r > s=,
which users would want to read as =p > (q > (r > s))=?
If you cannot change the program,
at least change the manual.

/An evaluation grammar/:
In the previous chapter we saw
a translation grammar for simultaneously specifying
the syntax of one language and its translation into another.
Try to devise a method
which can be used to simultaneously specify both the syntax
of infix formulas and their value.
For some advanced reading,
see Lewis, Rosenkrantz and Stearns (1978) on translation grammars
and attribute grammars.
For an exceptionally successful attempt at writing
semi-formal specifications without much need for explaining
the specification language,
see Lieberman (1987).
Another excellent self-explanatory semi-formal technique,
this time for a functional language,
is used throughout the book by
Glaser, Hankin and Till (1984).

/Values of subformulas/:
Change either the basic evaluator or any of its
more elaborate versions so that it writes
the value of /each/ subformula underneath its operator.

/Arithmetic/:
Write an evaluator for arithmetical expressions
with just a few basic operations.
You should ensure that all possible user errors
are treated properly.
Write a manual.

/A Small APL/:
A sophisticated language with heavy emphasis on array processing
is APL.
For example, the expression =1 2 3 + 10 20 30=
denotes the addition of two arrays of three numbers each,
and its value is the array =11 22 33=.
Study a manual for APL (but do not be put off by the fancy characterset),
and then design and implement a very small subset,
but including at least array operations as in the example.
Note that whereas for evaluators of logical or arithmetical
expressions the values can always be returned in =VAR=
parameters,
this technique does not work when the values are
arrays of arbitrary sizes.

/A SET evaluator/:
Design a notation for expressions in which the basic values
are not truth values or numbers or arrays of numbers,
but sets of lower case letters.
You need notations for sets given by enumeration of their members,
for the nullset and the universal set,
for complementation, intersection, union and difference.
The four last mentioned operations should have some
reasonable precedences to minimise the need for parentheses.
Write a manual, design the program, write the program.

As a further refinement, add relational operators
for inclusion and equivalence of sets ---
note that these return logical values.
Once there are logical values,
it seems natural to add the truth functional connectives, too.
Give a lot of thought to the precedences
of 1)~the logical connectives,
2)~the relational operators,
and 3)~the set operations.

/Evaluators in other domains/:
You are in a city in which all streets run either north-south
or east-west.
Any movement you can make is in one of the four directions,
north, south, east and west --- taken to mean up to the next
intersection.
Call these moves =N=, =S=, =E= and =W=,
and a sequence of moves is written in the order of the moves,
e.g. =NES= means moving north, then east, then south.
Clearly that move is equivalent to just moving east.
Similarly, =NENWWS= is equivalent to =WN=.
Write a program which reads sequences of moves
and then writes a minimal sequence which is equivalent to it.
Note that often there will be several equivalent minimal sequences,
so some decision is needed as to which of the
equivalent minimal sequences is written out.

In modal logic there are three unary operators,
for negation, possibility and necessity.
Assume that they are written as the characters =-=, =P= and =N=.
In some modal logics different sequences of the unary operators
can be equivalent,
in the sense that when they operate on the same formula
then the resulting formulas are logically equivalent.
For example, in most modal logics =-N-= is equivalent to =P=,
and =-P-= is equivalent to =N=,
and in many modal logics =NP= and =PP= are equivalent to =P=.
Study some modal system, and write a program
which reduces sequences of unary operators to an equivalent minimal form.
Alternatively, write a program which does the same for
a temporal logic, in which the unary operators
are negation, always (in the future), sometimes (in the future)
and next (instant in time).
The idea of writing a program for reducing modalities
was suggested to me by Rory Deutsch.

