03-infix-evaluator.html
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Exercises and reading</h2>
<div class="outline-text-2" id="text-5">
<p>
<i>No GOTO</i>:
Rewrite the program without GOTO.
</p>

<p>
<i>Prefix notation</i>:
Write an evaluator for logical expressions in prefix
notation.
You should write the parser first,
and you might well do so by <i>cannibalising</i>
the program from the previous chapter.
Of course you will have to replace the atoms <code>a</code> .. <code>z</code>
by <code>0</code> and <code>1</code>.
Write a manual, too.
A more ambitious project is to write an evaluator
for Cambridge notation.
</p>

<p>
<i>End of file</i>:
Neither this program nor the one in the previous chapter
treats end of file inside a formula well:
there really should be an error message.
But how can you then deal with end of file
when the user has finished?
Devise some method and implement it.
Change the manual where appropriate.
</p>

<p>
<i>Translator</i>:
Write a translator from fully parenthesised
infix notation to prefix notation.
This is one of the translation problems mentioned at the end
of the previous chapter which involved shifting operators
forward.
&gt;From fully parenthesised infix notation it is not all that hard.
</p>

<p>
<i>No outermost parentheses</i>:
It would be nice if the outermost parentheses of formulas
could be omitted. What problems do you foresee?
You should keep in mind that users might want to write
a formula over several lines,
and also that they write trailing blanks on the same line.
Discuss these problems, and propose a solution.
</p>

<p>
<i>Minimising Parentheses</i>:
When there are long conjunctions etc.
the infix notation used here forces users to write
a Lot of Irritating Silly Parentheses.
For example, assuming that
<code>p</code>, <code>q</code>, <code>r</code>, <code>s</code> are formulas,
instead of <code>p &amp; q &amp; r &amp; s</code>
one has to write <code>((p &amp; q) &amp; (r &amp; s))</code>
or something like that.
Can you fix the program
so that it allows operator precedences
described in the exercises of the previous chapter?
Does your method work for <code>p &gt; q &gt; r &gt; s</code>,
which users would want to read as <code>p &gt; (q &gt; (r &gt; s))</code>?
If you cannot change the program,
at least change the manual.
</p>

<p>
<i>An evaluation grammar</i>:
In the previous chapter we saw
a translation grammar for simultaneously specifying
the syntax of one language and its translation into another.
Try to devise a method
which can be used to simultaneously specify both the syntax
of infix formulas and their value.
For some advanced reading,
see Lewis, Rosenkrantz and Stearns (1978) on translation grammars
and attribute grammars.
For an exceptionally successful attempt at writing
semi-formal specifications without much need for explaining
the specification language,
see Lieberman (1987).
Another excellent self-explanatory semi-formal technique,
this time for a functional language,
is used throughout the book by
Glaser, Hankin and Till (1984).
</p>

<p>
<i>Values of subformulas</i>:
Change either the basic evaluator or any of its
more elaborate versions so that it writes
the value of <i>each</i> subformula underneath its operator.
</p>

<p>
<i>Arithmetic</i>:
Write an evaluator for arithmetical expressions
with just a few basic operations.
You should ensure that all possible user errors
are treated properly.
Write a manual.
</p>

<p>
<i>A Small APL</i>:
A sophisticated language with heavy emphasis on array processing
is APL.
For example, the expression <code>1 2 3 + 10 20 30</code>
denotes the addition of two arrays of three numbers each,
and its value is the array <code>11 22 33</code>.
Study a manual for APL (but do not be put off by the fancy characterset),
and then design and implement a very small subset,
but including at least array operations as in the example.
Note that whereas for evaluators of logical or arithmetical
expressions the values can always be returned in <code>VAR</code>
parameters,
this technique does not work when the values are
arrays of arbitrary sizes.
</p>

<p>
<i>A SET evaluator</i>:
Design a notation for expressions in which the basic values
are not truth values or numbers or arrays of numbers,
but sets of lower case letters.
You need notations for sets given by enumeration of their members,
for the nullset and the universal set,
for complementation, intersection, union and difference.
The four last mentioned operations should have some
reasonable precedences to minimise the need for parentheses.
Write a manual, design the program, write the program.
</p>

<p>
As a further refinement, add relational operators
for inclusion and equivalence of sets &#x2014;
note that these return logical values.
Once there are logical values,
it seems natural to add the truth functional connectives, too.
Give a lot of thought to the precedences
of 1)~the logical connectives,
2)~the relational operators,
and 3)~the set operations.
</p>

<p>
<i>Evaluators in other domains</i>:
You are in a city in which all streets run either north-south
or east-west.
Any movement you can make is in one of the four directions,
north, south, east and west &#x2014; taken to mean up to the next
intersection.
Call these moves <code>N</code>, <code>S</code>, <code>E</code> and <code>W</code>,
and a sequence of moves is written in the order of the moves,
e.g. <code>NES</code> means moving north, then east, then south.
Clearly that move is equivalent to just moving east.
Similarly, <code>NENWWS</code> is equivalent to <code>WN</code>.
Write a program which reads sequences of moves
and then writes a minimal sequence which is equivalent to it.
Note that often there will be several equivalent minimal sequences,
so some decision is needed as to which of the
equivalent minimal sequences is written out.
</p>

<p>
In modal logic there are three unary operators,
for negation, possibility and necessity.
Assume that they are written as the characters <code>-</code>, <code>P</code> and <code>N</code>.
In some modal logics different sequences of the unary operators
can be equivalent,
in the sense that when they operate on the same formula
then the resulting formulas are logically equivalent.
For example, in most modal logics <code>-N-</code> is equivalent to <code>P</code>,
and <code>-P-</code> is equivalent to <code>N</code>,
and in many modal logics <code>NP</code> and <code>PP</code> are equivalent to <code>P</code>.
Study some modal system, and write a program
which reduces sequences of unary operators to an equivalent minimal form.
Alternatively, write a program which does the same for
a temporal logic, in which the unary operators
are negation, always (in the future), sometimes (in the future)
and next (instant in time).
The idea of writing a program for reducing modalities
was suggested to me by Rory Deutsch.
</p>
</div>
</div>
</div>
</body>
</html>
